# Practice

In [63]:
import pandas as pd
import numpy as np
import random

In [3]:
dict_data = {'a':1,'b':2,'c':3}
sr = pd.Series(dict_data)
sr

a    1
b    2
c    3
dtype: int64

In [5]:
list_data = ['2019-07-02', 3.14, 'ABC', 100, True]
sr1 = pd.Series(list_data)
sr1

0    2019-07-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [8]:
tup_data = ('kevin','2019-07-02','남',True)
sr2 = pd.Series(tup_data, index=['이름','생년월일','성별','학생여부'])
sr2

이름           kevin
생년월일    2019-07-02
성별               남
학생여부          True
dtype: object

In [18]:
print(sr2[0])
print(sr2['이름'])
sr2.iloc[0]
sr2.loc['이름']
print(sr2[:3])
sr2[['이름','성별']]

kevin
kevin
이름           kevin
생년월일    2019-07-02
성별               남
dtype: object

이름    kevin
성별        남
dtype: object

In [19]:
data = np.arange(1000,5000,1000)
state = ['Califonia','Ohio','Oregon','Texas']
sr5 = pd.Series(data,index=state)
sr5

Califonia    1000
Ohio         2000
Oregon       3000
Texas        4000
dtype: int32

In [23]:
sr5.name = 'population'
sr5.index.name='state'
display(sr5)

state
Califonia    1000
Ohio         2000
Oregon       3000
Texas        4000
Name: population, dtype: int32

In [27]:
sr5['Califonia']=np.nan
sr5

state
Califonia       NaN
Ohio         2000.0
Oregon       3000.0
Texas        4000.0
Name: population, dtype: float64

In [32]:
sr5.isnull().sum().sum()

1

In [39]:
df = np.random.randint(10,size=(3,3))
df

array([[6, 3, 2],
       [7, 4, 9],
       [8, 7, 8]])

In [44]:
df1 = pd.DataFrame(df,columns=['pd','sales','inv'],index=['d1','d2','d3'])
df1

    pd  sales  inv
d1   6      3    2
d2   7      4    9
d3   8      7    8

In [45]:
df1.iloc[1:,2:]

    inv
d2    9
d3    8

In [46]:
df1.loc['d2','sales']

4

In [57]:
df1.loc['d3']=0
df1
df1.loc['d4']=0
df1

    pd  sales  inv  d3
d1   6      3    2   0
d2   7      4    9   0
d3   0      0    0   0
d4   0      0    0   0

In [60]:
df1.iloc[1,1]=0
df1

    pd  sales  inv  d3
d1   6      3    2   0
d2   7      0    9   0
d3   0      0    0   0
d4   0      0    0   0

In [80]:
d = pd.Series(np.random.randint(1,10,4))
gender = pd.Series(np.random.randint(1,10,4))
age = pd.Series(np.random.randint(1,10,4))
region = pd.Series(np.random.randint(1,10,4))

df = pd.concat([d,gender,age,region], axis=1)
df = df.rename(columns={0:'d',1:'gender',2:'age',3:'region'})
df

   d  gender  age  region
0  1       3    1       9
1  5       9    8       8
2  4       4    3       7
3  1       1    8       1

In [84]:
df.iloc[:2,:]= np.nan
df

     d  gender  age  region
0  NaN     NaN  NaN     NaN
1  NaN     NaN  NaN     NaN
2  4.0     4.0  3.0     7.0
3  1.0     1.0  8.0     1.0

In [88]:
df.isnull().sum().sum()

8

In [105]:
arr = np.random.randint(1,5,size=(10,5))
arr

array([[3, 2, 1, 1, 2],
       [2, 2, 2, 4, 2],
       [2, 1, 2, 1, 4],
       [2, 4, 1, 3, 4],
       [3, 4, 1, 4, 1],
       [4, 1, 4, 2, 4],
       [1, 4, 1, 4, 2],
       [2, 3, 2, 1, 2],
       [1, 2, 1, 3, 3],
       [3, 2, 1, 2, 4]])

In [113]:
liar = arr.tolist()
df=pd.DataFrame(liar)

In [114]:
dic=df.to_dict('list')

In [117]:
df1 = pd.DataFrame({'col1':[1,2,3,4,5,6],'col2':['a','a','b','b','c','c']})
df1

   col1 col2
0     1    a
1     2    a
2     3    b
3     4    b
4     5    c
5     6    c

In [120]:
df1['col3']= 'e'
df1

   col1 col2 col3
0     1    a    e
1     2    a    e
2     3    b    e
3     4    b    e
4     5    c    e
5     6    c    e

In [126]:
df3 = pd.DataFrame({'col1':[1,2,3],'col2':['a','b','c']})
df4 = pd.DataFrame({'col1':[4,5,6],'col2':['d','e','f']})
df5 = pd.concat([df3,df4],axis=0)
df5

   col1 col2
0     1    a
1     2    b
2     3    c
0     4    d
1     5    e
2     6    f

In [129]:
df5.drop('col1',axis=1)

  col2
0    a
1    b
2    c
0    d
1    e
2    f

In [138]:
df5.drop([0])
df5

   col1 col2
0     1    a
1     2    b
2     3    c
0     4    d
1     5    e
2     6    f

In [143]:
df5.iloc[4,:]

col1    5
col2    e
Name: 1, dtype: object

In [156]:
df5.loc[:,['col1','col3']]

     col1 col3
0       1    d
1       2    d
2       3    d
0       4    d
1       5    d
2       6    d
col3    d    d

In [159]:
df5.iloc[0:2,:]

  col1 col2 col3
0    1    a    d
1    2    b    d

In [160]:
df = pd.DataFrame({'a':[1,2,3],'b':[4,5,6],'c':[7,8,9],'d':[1,2,6],'e':[3,6,8],'f':[8,4,0]})

In [163]:
df.rename(index=['오','이','사'], columns=['q','w','e','d','c','z'])

TypeError: 'list' object is not callable

In [164]:
df

   a  b  c  d  e  f
0  1  4  7  1  3  8
1  2  5  8  2  6  4
2  3  6  9  6  8  0

In [197]:
df.e[2]

8

In [198]:
df.e=0
df

   a  b  c  d  e  f
0  1  4  7  1  0  8
1  2  5  8  2  0  4
2  3  6  9  6  0  0

In [199]:
df.iloc[1:2,1:4]

   b  c  d
1  5  8  2

In [203]:
df.b[1]=df.c[1]

In [205]:
df.sort_index()

   a  b  c  d  e  f
0  1  4  7  1  0  8
1  2  8  8  2  0  4
2  3  6  9  6  0  0

In [207]:
df.sort_values(by='f')

   a  b  c  d  e  f
2  3  6  9  6  0  0
1  2  8  8  2  0  4
0  1  4  7  1  0  8

In [208]:
df.transpose()

   0  1  2
a  1  2  3
b  4  8  6
c  7  8  9
d  1  2  6
e  0  0  0
f  8  4  0

In [ ]:
df.T